app/views/orders/index.html.erb

<% @orders.each do |order| %>
  <% products = order.products.find_all{|p| p if p.brand_id == @current_vendor.brand_id} %>
---
SELECT `products`.* FROM `products` WHERE `products`.`order_id` = 1