app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `description`, `price`, `quantity_available`, `title`, `updated_at`) VALUES ('2012-03-09 07:28:52', 'red potatoes', 1, 20, 'Potato 1 lb', '2012-03-09 07:28:52')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save