app/controllers/sessions_controller.rb

SELECT `vendors`.* FROM `vendors` WHERE `vendors`.`email` = 'hrajagopal@yahoo.com' LIMIT 1
---
  def create
    vendor = Vendor.find_by_email(params[:email])