app/controllers/vendors_controller.rb

  def create
    @vendor = Vendor.new(params[:vendor])
    if @vendor.save
---
INSERT INTO `vendors` (`brand_id`, `created_at`, `email`, `password_digest`, `updated_at`) VALUES ('-1', '2012-05-12 17:49:35', 'hari@connect2fresh.com', '$2a$10$nKBTHYqVM7ugawgOmyOShez4VNauBCdca9dkGVobn9NBL.ute5tsy', '2012-05-12 17:49:35')